Public Attributes | List of all members
API_IFCEntityDescriptor Struct Reference
IFC Data Access
Contains IFC Global ID and Archicad ID of an IFC Entity. More...
#include <APIdefs_IFC.h>
 Public Attributes
API_Guid  | ifcGlobalId
IFC Global ID.
API_Guid  | elementID
Archicad ID.
Detailed Description
Contains IFC Global ID and Archicad ID of an IFC Entity.
Member Data Documentation
◆ elementID
 API_IFCEntityDescriptor::elementID
Archicad ID.
◆ ifcGlobalId
 API_IFCEntityDescriptor::ifcGlobalId
IFC Global ID.